/*************************************************************************
【文件名】Importer.cpp
【功能模块和目的】定义Importer类
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了Importer类非纯虚成员函数的定义
*************************************************************************/

#include "header/Importer.hpp"
#include "header/Model3D.hpp"
#include <exception>
#include <fstream>
#include <string>

/*************************************************************************
【函数名称】Importer::isOpen
【函数功能】判断是否打开文件
【参数】无参数
【返回值】bool类型，若已打开文件则返回true.
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
bool Importer::isOpen(){
    return m_file.is_open();
}

/*************************************************************************
【函数名称】Importer::OpenFile
【函数功能】打开文件。若已打开文件，则先关闭。
【参数】
    path: 打开文件的路径
【返回值】无返回值
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
void Importer::OpenFile(std::string path){
    close();
    m_file.open(path);
    if(!isOpen()){
        throw std::exception("Cannot Open the File!");
    }
}

/*************************************************************************
【函数名称】Importer::close
【函数功能】关闭文件
【参数】无参数
【返回值】无返回值
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
void Importer::close(){
    m_file.close();
}

/*************************************************************************
【函数名称】Importer::Load
【函数功能】从路径中加载Model3D
【参数】
    path: 文件路径
【返回值】Model3D类型，为读取到的模型
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
Model3D Importer::Load(std::string path){
    if (!checkExtension(path)) {
        throw std::exception("Invalid file name!");
    }
    OpenFile(path);
    Model3D model = read();
    close();
    return model;
}

/*************************************************************************
【函数名称】Importer::getFile
【函数功能】为派生类提供获取文件的接口
【参数】无参数
【返回值】std::ifstream&类型，返回文件
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
std::ifstream& Importer::getFile() {
    return m_file;
}

/*************************************************************************
【函数名称】Importer::~Importer
【函数功能】默认析构函数
【参数】无参数
【返回值】无返回值
【开发者及日期】李宜阳(liyiyang23@mails.tsinghua.edu.cn) 2024-07-23
【更改记录】
    2024-07-23 完成了函数定义
*************************************************************************/
Importer::~Importer() {}
